# Polyloop Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Polyloop Members
Polyloop Class Methods Properties See Also
---
The Polyloop type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ComputeArea | Gets the area for this polygon. |
| Dispose | Releases all resources used by the Polyloop |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetPoints | Gets the array of points in the polygon. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Centroid | The polygon centroid. |
| Direction | The direction for the outward normal for this polygon. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace